content-org/calculations.org
#+HUGO_BASE_DIR: ../
#+HUGO_SECTION: calculations
#+HUGO_WEIGHT: auto
#+HUGO_PAIRED_SHORTCODES: katex
#+OPTIONS: ^:{}

* Variables
:PROPERTIES:
:EXPORT_FILE_NAME: variables
:END:
** Assigning Variables

Often times you want to store the results of calculations for later use. Instead of writing down numbers and typing them out again, you can assign a variable with === (the /assignment/ operator).

#+BEGIN_EXPORT html
<pre class="julia-repl"><font color="#98C379"><b>julia&gt; </b></font>x = sqrt(2)
1.4142135623730951
</pre>
#+END_EXPORT

Now, you can use =x= in place of =1.4142135623730951= in your future calculations.

#+BEGIN_EXPORT html
<pre class="julia-repl"><font color="#98C379"><b>julia&gt; </b></font>x + 1
2.414213562373095
</pre>
#+END_EXPORT

You can also reassign =x= to another value if you change your mind:

#+BEGIN_EXPORT html
<pre class="julia-repl"><font color="#98C379"><b>julia&gt; </b></font>x = 1.5
1.5

<font color="#98C379"><b>julia&gt; </b></font>x + 2
3.5
</pre>
#+END_EXPORT

#+hugo: {{< hint type=caution >}}
It is important to note that === in Julia is not like equality in math. It is called an /assignment/ operator because it /assigns/ the variable on the left side to the value on the right side.
#+hugo: {{< /hint >}}

Variable names don't have to be a single character. They can be multiple characters long and contain letters, underscores (i.e. =_=), numbers, and even emoji. They cannot start with a number, though.

#+BEGIN_EXPORT html
<pre class="julia-repl"><font color="#98C379"><b>julia&gt; </b></font>days_in_week = 7
7

<font color="#98C379"><b>julia&gt; </b></font>my_variable = 3 * days_in_week
21

<font color="#98C379"><b>julia&gt; </b></font>😂 = 5/7
0.7142857142857143
</pre>
#+END_EXPORT

You can't start a variable name with a number because Julia interprets a number before a variable as multiplication. For example:

#+BEGIN_EXPORT html
<pre class="julia-repl"><font color="#98C379"><b>julia&gt; </b></font>x = 3
3

<font color="#98C379"><b>julia&gt; </b></font>5x
15
</pre>
#+END_EXPORT

If you want to see the value of a variable, you can just evaluate it by itself:

#+BEGIN_EXPORT html
<pre class="julia-repl"><font color="#98C379"><b>julia&gt; </b></font>x = 12 * 21
252

<font color="#98C379"><b>julia&gt; </b></font>x
252
</pre>
#+END_EXPORT

** Changing Variables

It's often useful to change the value stored in a variable. For example, say you had a quantity stored in meters inside a variable called =distance= and you want to store it in centimeters instead.

#+BEGIN_EXPORT html
<pre class="julia-repl"><font color="#98C379"><b>julia&gt; </b></font>distance = 1.5
1.5
</pre>
#+END_EXPORT

The value in centimeters is ~distance * 100~, so this value is stored back into ~distance~.

#+BEGIN_EXPORT html
<pre class="julia-repl"><font color="#98C379"><b>julia&gt; </b></font>distance = distance * 100
150.0
</pre>
#+END_EXPORT

Remember, the left hand side of an assignment has the variables that are being stored. The right hand side is the value. When the code gets executed, the ~distance~ on the right side is substituted for its value:

#+BEGIN_EXPORT html
<pre class="julia-repl"><font color="#98C379"><b>julia&gt; </b></font>distance = 1.5 * 100
150.0
</pre>
#+END_EXPORT

# TODO: Compound assignment operators

** Exercises
*** Exercise 1

Using [[https://nssdc.gsfc.nasa.gov/planetary/factsheet/][NASA's planetary fact sheet]], make variables for the mass of each planet in the solar system, the moon, and Pluto. Also make a variable for the sun's mass using [[https://nssdc.gsfc.nasa.gov/planetary/factsheet/sunfact.html][NASA's sun fact sheet]].

Then, answer the following questions:
1. What percent of the solar system's total mass does the sun take up? What about Earth? Jupiter?
2. In kg, how much more mass does Jupiter have than Saturn? How many Earths worth of mass is this?
3. How many more times massive is the moon than Pluto?
*** Exercise 2

Determine the mass in kg of a few everyday objects (like a car or banana) and make a variable for each one.

For each of these object, determine how many of them have the same mass as
1. The solar system
2. Jupiter
3. Earth
4. Pluto

